posts/20260318-job-posting.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Job Posting</title>
<meta name="author" content="Greg Silverstein" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/me/css/style.css">
<link rel="alternate" type="application/rss+xml" title="./greg.out" href="/me/index.xml">
<meta name="viewport" content="width=device-width, initial-scale=1">
</head>
<body>
<div id="preamble" class="status">
<header class="site-header"><div class="wrap"><div class="brand"><a class="logo" href="/me/">./greg.out</a><div class="subtitle">Greg Silverstein's Home on the internet</div></div><nav><a href="/me/">Home</a><a href="/me/about.html">About</a><a href="/me/resume.html">Resume</a><a href="/me/index.xml">RSS</a><a href="https://github.com/gsilvers">GitHub</a></nav></div></header><div class="wrap page-head"><h1 class="page-title">Job Posting</h1><div class="page-meta">2026-03-18</div></div>
</div>
<div id="content" class="content">
<p>
The "agentic" coding hype is getting a bit crazy. I recieved a spam email with this job posting in it this week:
</p>

<blockquote>
<p>
Agentic first software engineer - Vibe coder / Claude Coder - Yolo expert
Wonder Dog
United States
Remote
$125,000 - $200,000 a year - Full-time
</p>
</blockquote>

<p>
I never expected to need to fact check through job openings with Yolo in them. Best I can tell Wonder Dog does not have a real website, and hopefully is not a real company but their posting is certainly on Indeed getting circulation.
</p>

<p>
What a world
</p>
</div>
<div id="postamble" class="status">
<footer class="site-footer"><div class="wrap">Written by Greg Silverstein &middot; theme <a href="https://github.com/protesilaos/ef-themes">ef-cherie</a> &middot; built with org-publish in GNU Emacs</div></footer>
</div>
</body>
</html>
